# Everledger Code Test

Author: Ninad G. Wadekar   
Date: 01/12/2021

In [1]:
# Need xlrd library for reading data and formatting information 
# from Excel files in the historical .xls format.

!pip install xlrd

Requirement already satisfied: xlrd in c:\users\61431\anaconda3\envs\ninad_haai\lib\site-packages (2.0.1)

In [2]:
# Importing necessary libraries

import pandas as pd
from datetime import datetime

# Task 1 - Parse the attached employee__1_.xls file

In [3]:
# Reading employee__1_.xls file and converting it to dataframe

df_employee = pd.read_excel('employee__1_.xls')
print('\n\nAnswer to Task 1:\n', df_employee)

Answer to Task 1:
     Emp ID First Name Last Name Gender     Father's Name       Mother's Name  \
0   677509       Lois    Walker      F     Donald Walker        Helen Walker
1   940761     Brenda  Robinson      F  Raymond Robinson       Judy Robinson
2   428945        Joe  Robinson      M    Scott Robinson  Stephanie Robinson
3   408351      Diane     Evans      F       Jason Evans      Michelle Evans
4   193819   Benjamin   Russell      M   Gregory Russell   Elizabeth Russell
..     ...        ...       ...    ...               ...                 ...
95  639892       Jose      Hill      M       Carlos Hill           Anna Hill
96  704709     Harold    Nelson      M    Richard Nelson       Pamela Nelson
97  461593     Nicole      Ward      F        Ralph Ward          Julia Ward
98  392491    Theresa    Murphy      F     George Murphy   Jacqueline Murphy
99  495141      Tammy     Young      F      Andrew Young        Brenda Young

   Mother's Maiden Name        Date of Birth      Date of Joining  \
0                 Lewis            3/29/1981           11/24/2003
1                 Perry            7/31/1970            7/27/2008
2                Taylor            6/16/1963  2016-03-08 00:00:00
3                 Allen  1977-04-12 00:00:00            4/16/1999
4                Nelson            4/17/1977            7/25/2013
..                  ...                  ...                  ...
95                Hayes  1994-08-10 00:00:00  2016-09-07 00:00:00
96                Smith           12/24/1984            8/23/2011
97                  Lee  1964-12-12 00:00:00            1/23/1989
98             Peterson           12/30/1987  2010-03-08 00:00:00
99             Robinson            3/22/1979            4/25/2015

   Quarter of Joining    Place Name              County          City State  \
0                  Q4        Denver              Denver        Denver    CO
1                  Q3     Stonewall             De Soto     Stonewall    LA
2                  Q3  Michigantown             Clinton  Michigantown    IN
3                  Q2      Hydetown            Crawford      Hydetown    PA
4                  Q3       Fremont             Waupaca       Fremont    WI
..                ...           ...                 ...           ...   ...
95                 Q3        Biloxi            Harrison        Biloxi    MS
96                 Q3  Carol Stream        Carol Stream  Carol Stream    IL
97                 Q1       Detroit               Wayne       Detroit    MI
98                 Q3      Mc Grath  Yukon-Koyukuk (CA)      Mc Grath    AK
99                 Q2          Alma             Gratiot          Alma    MI

      Zip   User Name
0   80224    lhwalker
1   71078  bsrobinson
2   46057  jwrobinson
3   16328     dievans
4   54940   brrussell
..    ...         ...
95  39532      jkhill
96  60351    hznelson
97  48278      noward
98  99627    trmurphy
99  48801     tbyoung

[100 rows x 16 columns]

# Task 2 - Normalize the date fields into a standard format

In [4]:
# 1. Check 1
# Let's first check shape of dataframe, data type of each column in the
# dataframe and if there are null values in the dataframe

print('1. Shape of dataframe: ', df_employee.shape)

print('\n2. Datatype of each column in the dataframe:\n',\
      df_employee.dtypes)

print('\n3 .Number of null values in each column:\n',\
      df_employee.isna().sum())

1. Shape of dataframe:  (100, 16)

2. Datatype of each column in the dataframe:
 Emp ID                   int64
First Name              object
Last Name               object
Gender                  object
Father's Name           object
Mother's Name           object
Mother's Maiden Name    object
Date of Birth           object
Date of Joining         object
Quarter of Joining      object
Place Name              object
County                  object
City                    object
State                   object
Zip                      int64
User Name               object
dtype: object

3 .Number of null values in each column:
 Emp ID                  0
First Name              0
Last Name               0
Gender                  0
Father's Name           0
Mother's Name           0
Mother's Maiden Name    0
Date of Birth           0
Date of Joining         0
Quarter of Joining      0
Place Name              0
County                  0
City                    0
State                   0
Zip                     0
User Name               0
dtype: int64

In [5]:
# After analyzing the data in above two steps it was found that
# most dates in Date of Birth and Date of Joining columns are
# strings and some others are in datetime format. 

# Assumption: I am assuming that string dates in both columns are
# in format mm/dd/yyyy by looking at joining date and quarter. 
# However, there is no way to validate that all the dates in both
# columns are in this format since data could have been collected
# from different sources. to_datetime() function in pandas by 
# default considers string in mm/dd/yyyy format. Hence we can use
# it directly.

# 2. Normalization of Date of Joining
# We can see from above column datatype description that Date of 
# Joining are object datatypes. Let's normalize these columns to 
# standard date format yyyy-mm-dd.

df_employee['Date of Joining'] = pd.to_datetime(df_employee['Date of Joining'],\
                                              errors='coerce')

# 3. Check 2 -  Let's check if quarter of joining is correct according 
# to date of joining. This will also make us aware if there are any 
# values in quarter apart from Q1, Q2, Q3, Q4.
print('\n\nIncorrect Quarters as per date of joining:\n')
for i in range(len(df_employee)):
    m = df_employee['Date of Joining'].iloc[i].month
    q = ((m-1)//3)+1
    quarter = 'Q'+str(q)
    if quarter != df_employee['Quarter of Joining'].iloc[i]:
        print(df_employee.iloc[[i]])
        print('\n\n')
        
# We can see from below results that there are some rows with quarter
# of joining not consistent with date of joining. After investigating
# it seems like these rows had date in yyyy-mm-dd HH:MM:SS format in
# original dataframe.

# Assumption: I am assuming for these rows that quarters are incorrect
# and changed the quarters to correct ones. 
for i in range(len(df_employee)):
    m = df_employee['Date of Joining'].iloc[i].month
    q = ((m-1)//3)+1
    quarter = 'Q'+str(q)
    if quarter != df_employee['Quarter of Joining'].iloc[i]:
        df_employee.iloc[i, df_employee.columns.\
                         get_loc("Quarter of Joining")] = quarter
        


# However, if we assume that quarters were correct for these rows but 
# in date of joining places of month and day were mistakenly replaced,
# we will have to modify dates. There is no way to assume that

Incorrect Quarters as per date of joining:

   Emp ID First Name Last Name Gender   Father's Name       Mother's Name  \
2  428945        Joe  Robinson      M  Scott Robinson  Stephanie Robinson

  Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
2               Taylor     6/16/1963      2016-03-08                 Q3

     Place Name   County          City State    Zip   User Name
2  Michigantown  Clinton  Michigantown    IN  46057  jwrobinson



    Emp ID First Name  Last Name Gender     Father's Name     Mother's Name  \
11  153989       Jack  Alexander      M  Samuel Alexander  Sharon Alexander

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
11               Walker     5/19/1995      2017-05-01                 Q1

   Place Name County       City State    Zip    User Name
11  Las Vegas  Clark  Las Vegas    NV  89170  jcalexander



    Emp ID First Name Last Name Gender Father's Name   Mother's Name  \
16  912990     Joshua   Stewart      M  Todd Stewart  Martha Stewart

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
16                Jones     5/18/1970      2002-02-09                 Q3

     Place Name   County         City State    Zip  User Name
16  New Douglas  Madison  New Douglas    IL  62074  jtstewart



    Emp ID First Name Last Name Gender Father's Name Mother's Name  \
19  622406     Thomas     Lewis      M    Ryan Lewis    Lois Lewis

   Mother's Maiden Name        Date of Birth Date of Joining  \
19                Price  1967-04-10 00:00:00      1998-07-06

   Quarter of Joining Place Name          County       City State    Zip  \
19                 Q2  Dutchtown  Cape Girardeau  Dutchtown    MO  63745

   User Name
19   tqlewis



    Emp ID First Name Last Name Gender Father's Name Mother's Name  \
21  969580    Matthew    Turner      M   Jose Turner  Kathy Turner

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
21                  Cox    10/26/1993      2016-07-02                 Q1

     Place Name          County         City State    Zip User Name
21  Heathsville  Northumberland  Heathsville    VA  22473  mlturner



    Emp ID First Name Last Name Gender Father's Name Mother's Name  \
24  560455    Carolyn     Hayes      F   Jimmy Hayes    Sara Hayes

   Mother's Maiden Name        Date of Birth Date of Joining  \
24               Foster  1958-10-03 00:00:00      2001-03-07

   Quarter of Joining   Place Name   County         City State    Zip  \
24                 Q3  Saint Cloud  Osceola  Saint Cloud    FL  34771

   User Name
24   cvhayes



    Emp ID First Name Last Name Gender Father's Name Mother's Name  \
26  263480     Daniel    Cooper      M  Louis Cooper  Julie Cooper

   Mother's Maiden Name        Date of Birth Date of Joining  \
26               Murphy  1990-01-01 00:00:00      2014-06-03

   Quarter of Joining Place Name County     City State    Zip User Name
26                 Q1    Manning   Dunn  Manning    ND  58642  dkcooper



    Emp ID First Name Last Name Gender Father's Name  Mother's Name  \
28  474599      Maria    Walker      F  Ralph Walker  Teresa Walker

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
28               Brooks     3/19/1975      1998-01-10                 Q4

      Place Name    County          City State    Zip User Name
28  Lawrenceburg  Lawrence  Lawrenceburg    TN  38464  mwwalker



    Emp ID First Name Last Name Gender Father's Name    Mother's Name  \
31  893212        Amy    Howard      F  James Howard  Virginia Howard

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
31              Collins     6/16/1981      2003-01-06                 Q2

   Place Name County   City State    Zip User Name
31      Kline  Kline  Kline    SC  29814  abhoward



    Emp ID First Name Last Name Gender  Father's Name Mother's Name  \
36  218791      Aaron     Price      M  Michael Price   Diana Price

   Mother's Maiden Name        Date of Birth Date of Joining  \
36               Torres  1969-10-02 00:00:00      1997-03-07

   Quarter of Joining Place Name    County     City State    Zip User Name
36                 Q3    Eckerty  Crawford  Eckerty    IN  47116   anprice



    Emp ID First Name Last Name Gender   Father's Name    Mother's Name  \
38  726264       Carl   Collins      M  Gerald Collins  Phyllis Collins

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
38            Rodriguez    12/22/1973      2007-09-06                 Q2

   Place Name     County    City State    Zip  User Name
38     Wright  Jefferson  Wright    AR  72182  cncollins



    Emp ID First Name Last Name Gender Father's Name    Mother's Name  \
43  247137       Alan    Rivera      M  Bobby Rivera  Jennifer Rivera

   Mother's Maiden Name        Date of Birth Date of Joining  \
43              Jackson  1978-11-12 00:00:00      2006-07-06

   Quarter of Joining Place Name County       City State    Zip User Name
43                 Q2  Knoxville   Knox  Knoxville    TN  37901  aerivera



    Emp ID First Name Last Name Gender Father's Name Mother's Name  \
49  879753     Pamela    Wright      F  Terry Wright  Debra Wright

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
49             Williams     4/14/1996      2017-09-06                 Q2

   Place Name    County    City State    Zip User Name
49     Banner  Sheridan  Banner    WY  82832  pxwright



    Emp ID First Name Last Name Gender Father's Name Mother's Name  \
55  253573     Sharon     Lopez      F  Daniel Lopez   Susan Lopez

   Mother's Maiden Name        Date of Birth Date of Joining  \
55                Hayes  1991-04-05 00:00:00      2014-07-03

   Quarter of Joining Place Name    County     City State    Zip User Name
55                 Q1    Bartley  McDowell  Bartley    WV  24813   selopez



    Emp ID First Name Last Name Gender   Father's Name   Mother's Name  \
58  491943      Nancy    Howard      F  Gregory Howard  Mildred Howard

   Mother's Maiden Name        Date of Birth Date of Joining  \
58               Flores  1961-05-05 00:00:00      1999-06-02

   Quarter of Joining Place Name     County  City State    Zip User Name
58                 Q1       Saxe  Charlotte  Saxe    VA  23967  nphoward



    Emp ID First Name Last Name Gender    Father's Name  Mother's Name  \
59  750173    Antonio   Roberts      M  Timothy Roberts  Diana Roberts

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
59            Rodriguez     8/27/1995      2017-01-05                 Q2

   Place Name     County      City State    Zip  User Name
59   Mc Calla  Jefferson  Mc Calla    AL  35111  arroberts



    Emp ID First Name Last Name Gender Father's Name Mother's Name  \
61  241882      Debra      Wood      F   Martin Wood  Theresa Wood

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
61                Perry    10/30/1969      1991-10-01                 Q1

   Place Name      County   City State    Zip User Name
61      Blair  Washington  Blair    NE  68009    dgwood



    Emp ID First Name Last Name Gender  Father's Name Mother's Name  \
63  940922    Melissa    Butler      F  Robert Butler   Anne Butler

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
63              Jackson    11/14/1994      2017-05-02                 Q1

   Place Name   County     City State    Zip User Name
63    Maxwell  Lincoln  Maxwell    NE  69151  mxbutler



    Emp ID First Name Last Name Gender Father's Name  Mother's Name  \
64  917937       Todd      Hall      M   Thomas Hall  Kathleen Hall

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
64               Morgan     8/31/1991      2016-08-05                 Q2

      Place Name     County          City State    Zip User Name
64  Randallstown  Baltimore  Randallstown    MD  21133    thhall



    Emp ID   First Name Last Name Gender   Father's Name   Mother's Name  \
65  917395  Christopher    Nelson      M  Jeffrey Nelson  Cynthia Nelson

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
65              Sanders     3/29/1960      1997-08-11                 Q4

      Place Name  County          City State    Zip User Name
65  Willow Beach  Mohave  Willow Beach    AZ  86445  cdnelson



    Emp ID First Name Last Name Gender   Father's Name     Mother's Name  \
67  316110     Jeremy   Sanchez      M  Albert Sanchez  Patricia Sanchez

   Mother's Maiden Name        Date of Birth Date of Joining  \
67                 Ross  1965-05-02 00:00:00      2006-02-04

   Quarter of Joining Place Name  County   City State    Zip  User Name
67                 Q2      Alcoa  Blount  Alcoa    TN  37701  jisanchez



    Emp ID First Name Last Name Gender   Father's Name    Mother's Name  \
71  478003    Cynthia     White      F  Nicholas White  Katherine White

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
71               Turner     6/15/1963      2004-04-03                 Q1

     Place Name   County         City State    Zip User Name
71  Kansas City  Jackson  Kansas City    MO  64133   cxwhite



    Emp ID First Name Last Name Gender  Father's Name Mother's Name  \
73  883936    Douglas    Flores      M  Justin Flores  Kathy Flores

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
73              Ramirez     4/21/1986      2009-10-09                 Q3

   Place Name County    City State    Zip User Name
73     Eckert  Delta  Eckert    CO  81418  diflores



    Emp ID First Name Last Name Gender Father's Name   Mother's Name  \
79  325319    Carolyn     Price      F   Kevin Price  Patricia Price

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
79             Williams     5/30/1976      2014-05-11                 Q4

   Place Name  County     City State    Zip User Name
79    Wheaton  DuPage  Wheaton    IL  60189   cfprice



    Emp ID First Name Last Name Gender Father's Name  Mother's Name  \
80  623253       Ruby   Stewart      F  Paul Stewart  Paula Stewart

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
80              Jackson    10/23/1968      2017-02-07                 Q3

   Place Name       County    City State    Zip  User Name
80     Margie  Koochiching  Margie    MN  56658  rqstewart



    Emp ID First Name Last Name Gender   Father's Name   Mother's Name  \
85  476433    Lillian  Mitchell      F  Harry Mitchell  Marie Mitchell

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
85               Murphy    10/23/1974      1999-07-12                 Q4

   Place Name    County     City State    Zip   User Name
85    Wichita  Sedgwick  Wichita    KS  67214  lnmitchell



    Emp ID First Name Last Name Gender Father's Name Mother's Name  \
86  533952      Kelly     Adams      F    Eric Adams  Janice Adams

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
86               Brooks     5/23/1975      2013-04-07                 Q3

   Place Name County  City State    Zip User Name
86       Meno  Major  Meno    OK  73760   kradams



    Emp ID First Name Last Name Gender Father's Name Mother's Name  \
90  185032     Eugene     Perez      M   Jimmy Perez    Lois Perez

   Mother's Maiden Name        Date of Birth Date of Joining  \
90                 Hall  1979-06-10 00:00:00      2014-08-12

   Quarter of Joining Place Name  County    City State    Zip User Name
90                 Q4     Racine  Racine  Racine    WI  53490   edperez



    Emp ID First Name Last Name Gender  Father's Name Mother's Name  \
91  867084    Deborah     Smith      F  Richard Smith   Diana Smith

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
91              Bennett    10/31/1977      2002-04-03                 Q1

   Place Name       County     City State    Zip User Name
91    Atqasuk  North Slope  Atqasuk    AK  99791   desmith



    Emp ID First Name Last Name Gender  Father's Name  Mother's Name  \
93  158666    Rebecca   Stewart      F  Roger Stewart  Carol Stewart

   Mother's Maiden Name        Date of Birth Date of Joining  \
93                  Cox  1961-11-08 00:00:00      1983-10-04

   Quarter of Joining    Place Name County          City State    Zip  \
93                 Q2  Independence   Inyo  Independence    CA  93526

    User Name
93  rastewart



    Emp ID First Name Last Name Gender Father's Name  Mother's Name  \
94  489424    Phillip     White      M  Harold White  Frances White

   Mother's Maiden Name        Date of Birth Date of Joining  \
94               Carter  1978-04-03 00:00:00      2016-05-01

   Quarter of Joining Place Name County      City State    Zip User Name
94                 Q1   Mapleton   Lane  Mapleton    OR  97453   pfwhite



    Emp ID First Name Last Name Gender  Father's Name      Mother's Name  \
98  392491    Theresa    Murphy      F  George Murphy  Jacqueline Murphy

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
98             Peterson    12/30/1987      2010-03-08                 Q3

   Place Name              County      City State    Zip User Name
98   Mc Grath  Yukon-Koyukuk (CA)  Mc Grath    AK  99627  trmurphy

In [6]:
# 4. Normalization of Date of Birth column
df_employee['Date of Birth'] = pd.to_datetime(df_employee['Date of Birth'],\
                                              errors='coerce')

In [7]:
print('\n\nAnswer to Task 2:\n')
print('Date of Birth and Date of Joining datatype changed:\n', df_employee.dtypes)

print('\n\ndf_employee with normalized date column \n\n', df_employee)

Answer to Task 2:

Date of Birth and Date of Joining datatype changed:
 Emp ID                           int64
First Name                      object
Last Name                       object
Gender                          object
Father's Name                   object
Mother's Name                   object
Mother's Maiden Name            object
Date of Birth           datetime64[ns]
Date of Joining         datetime64[ns]
Quarter of Joining              object
Place Name                      object
County                          object
City                            object
State                           object
Zip                              int64
User Name                       object
dtype: object


df_employee with normalized date column

     Emp ID First Name Last Name Gender     Father's Name       Mother's Name  \
0   677509       Lois    Walker      F     Donald Walker        Helen Walker
1   940761     Brenda  Robinson      F  Raymond Robinson       Judy Robinson
2   428945        Joe  Robinson      M    Scott Robinson  Stephanie Robinson
3   408351      Diane     Evans      F       Jason Evans      Michelle Evans
4   193819   Benjamin   Russell      M   Gregory Russell   Elizabeth Russell
..     ...        ...       ...    ...               ...                 ...
95  639892       Jose      Hill      M       Carlos Hill           Anna Hill
96  704709     Harold    Nelson      M    Richard Nelson       Pamela Nelson
97  461593     Nicole      Ward      F        Ralph Ward          Julia Ward
98  392491    Theresa    Murphy      F     George Murphy   Jacqueline Murphy
99  495141      Tammy     Young      F      Andrew Young        Brenda Young

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
0                 Lewis    1981-03-29      2003-11-24                 Q4
1                 Perry    1970-07-31      2008-07-27                 Q3
2                Taylor    1963-06-16      2016-03-08                 Q1
3                 Allen    1977-04-12      1999-04-16                 Q2
4                Nelson    1977-04-17      2013-07-25                 Q3
..                  ...           ...             ...                ...
95                Hayes    1994-08-10      2016-09-07                 Q3
96                Smith    1984-12-24      2011-08-23                 Q3
97                  Lee    1964-12-12      1989-01-23                 Q1
98             Peterson    1987-12-30      2010-03-08                 Q1
99             Robinson    1979-03-22      2015-04-25                 Q2

      Place Name              County          City State    Zip   User Name
0         Denver              Denver        Denver    CO  80224    lhwalker
1      Stonewall             De Soto     Stonewall    LA  71078  bsrobinson
2   Michigantown             Clinton  Michigantown    IN  46057  jwrobinson
3       Hydetown            Crawford      Hydetown    PA  16328     dievans
4        Fremont             Waupaca       Fremont    WI  54940   brrussell
..           ...                 ...           ...   ...    ...         ...
95        Biloxi            Harrison        Biloxi    MS  39532      jkhill
96  Carol Stream        Carol Stream  Carol Stream    IL  60351    hznelson
97       Detroit               Wayne       Detroit    MI  48278      noward
98      Mc Grath  Yukon-Koyukuk (CA)      Mc Grath    AK  99627    trmurphy
99          Alma             Gratiot          Alma    MI  48801     tbyoung

[100 rows x 16 columns]

# Task 3 - Group the employee list based on the field "Quarter of Joining" and sorted by the field "Date of Birth" and print as dictionary {Q1 : [emp1, emp2, ...]}

In [9]:
# 1. Check 1
# Since we need to display employee name, let's check if there are
# more than one employees with same First Name.
print('Results show if First Name is same for multiple employees: \n',\
      df_employee['First Name'].value_counts())

Results show if First Name is same for multiple employees:
 Nancy     4
Brenda    2
Ruby      2
Cheryl    2
Ernest    2
         ..
Maria     1
Carl      1
Peter     1
Jose      1
Thomas    1
Name: First Name, Length: 79, dtype: int64

In [10]:
# We can see from above results that some employees have same first
# names. To improve probability of uniquely identifing employees 
# belonging to particular Quarter in final results, we can merge  
# First Name and Last Name to create new column called Full Name.

df_employee['Full Name'] = df_employee[['First Name', 'Last Name']]\
                            .apply(lambda x: ' '.join(x), axis=1)

print('\n Dataframe with new column Full Name:\n',df_employee)

 Dataframe with new column Full Name:
     Emp ID First Name Last Name Gender     Father's Name       Mother's Name  \
0   677509       Lois    Walker      F     Donald Walker        Helen Walker
1   940761     Brenda  Robinson      F  Raymond Robinson       Judy Robinson
2   428945        Joe  Robinson      M    Scott Robinson  Stephanie Robinson
3   408351      Diane     Evans      F       Jason Evans      Michelle Evans
4   193819   Benjamin   Russell      M   Gregory Russell   Elizabeth Russell
..     ...        ...       ...    ...               ...                 ...
95  639892       Jose      Hill      M       Carlos Hill           Anna Hill
96  704709     Harold    Nelson      M    Richard Nelson       Pamela Nelson
97  461593     Nicole      Ward      F        Ralph Ward          Julia Ward
98  392491    Theresa    Murphy      F     George Murphy   Jacqueline Murphy
99  495141      Tammy     Young      F      Andrew Young        Brenda Young

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
0                 Lewis    1981-03-29      2003-11-24                 Q4
1                 Perry    1970-07-31      2008-07-27                 Q3
2                Taylor    1963-06-16      2016-03-08                 Q1
3                 Allen    1977-04-12      1999-04-16                 Q2
4                Nelson    1977-04-17      2013-07-25                 Q3
..                  ...           ...             ...                ...
95                Hayes    1994-08-10      2016-09-07                 Q3
96                Smith    1984-12-24      2011-08-23                 Q3
97                  Lee    1964-12-12      1989-01-23                 Q1
98             Peterson    1987-12-30      2010-03-08                 Q1
99             Robinson    1979-03-22      2015-04-25                 Q2

      Place Name              County          City State    Zip   User Name  \
0         Denver              Denver        Denver    CO  80224    lhwalker
1      Stonewall             De Soto     Stonewall    LA  71078  bsrobinson
2   Michigantown             Clinton  Michigantown    IN  46057  jwrobinson
3       Hydetown            Crawford      Hydetown    PA  16328     dievans
4        Fremont             Waupaca       Fremont    WI  54940   brrussell
..           ...                 ...           ...   ...    ...         ...
95        Biloxi            Harrison        Biloxi    MS  39532      jkhill
96  Carol Stream        Carol Stream  Carol Stream    IL  60351    hznelson
97       Detroit               Wayne       Detroit    MI  48278      noward
98      Mc Grath  Yukon-Koyukuk (CA)      Mc Grath    AK  99627    trmurphy
99          Alma             Gratiot          Alma    MI  48801     tbyoung

           Full Name
0        Lois Walker
1    Brenda Robinson
2       Joe Robinson
3        Diane Evans
4   Benjamin Russell
..               ...
95         Jose Hill
96     Harold Nelson
97       Nicole Ward
98    Theresa Murphy
99       Tammy Young

[100 rows x 17 columns]

In [11]:
# 2. Sorting and Grouping
# Ref: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html
# Groupby preserves the order of rows of original dataframe within each group. 
# Thus we can sort first based on Date of Birth and then groupby Quarter of Joining 
# and subsequently converting results into dictionary

grouped_sorted_emp_dict = df_employee.sort_values(['Date of Birth'], ascending=False)\
                            .groupby('Quarter of Joining')['Full Name']\
                            .apply(list)\
                            .to_dict()

print(grouped_sorted_emp_dict)

{'Q1': ['Antonio Roberts', 'Ann Cooper', 'Theresa Lee', 'Martha Washington', 'Ernest Martinez', 'Larry Miller', 'Theresa Murphy', 'Diana Peterson', 'Steven Phillips', 'Ernest Washington', 'Cynthia Ramirez', 'Amy Howard', 'Maria Walker', 'Joshua Stewart', 'Aaron Price', 'Roger Roberts', 'Ruby Stewart', 'William Hernandez', 'Jeremy Sanchez', 'Nicole Ward', 'Elizabeth Jackson', 'Joe Robinson', 'Julia Scott', 'Judy Gonzales', 'Carolyn Hayes', 'Carol Murphy'], 'Q2': ['Jack Alexander', 'Carol Edwards', 'Melissa Butler', 'Linda Moore', 'Daniel Cooper', 'Andrea Garcia', 'Henry Jenkins', 'Amanda Hughes', 'Lillian Brown', 'Margaret Allen', 'Tammy Young', 'Phillip White', 'Deborah Smith', 'Diane Evans', 'Carolyn Price', 'Kelly Adams', 'Ralph Flores', 'Cynthia White', 'Mary Bryant', 'Joyce Jenkins', 'Nancy Howard', 'Frances Young', 'Paul Watson'], 'Q3': ['Wayne Watson', 'Pamela Wright', 'Nancy Baker', 'Jose Hill', 'Matthew Turner', 'Gregory Edwards', 'Richard Mitchell', 'Ryan Alexander', 'Margaret Brooks', 'Paul Cooper', 'Todd Hall', 'Roy Griffin', 'Sharon Lopez', 'Cheryl Miller', 'Jack Campbell', 'Harold Nelson', 'Nancy Davis', 'Donna Brown', 'Patrick Bailey', 'Janice Parker', 'Ruby Rogers', 'Eugene Perez', 'Alan Rivera', 'Benjamin Russell', 'Lillian Mitchell', 'Jason Anderson', 'Carl Collins', 'Brenda Robinson', 'Thomas Lewis', 'Paula Diaz', 'Brenda Butler', 'Frances Watson', 'Christopher Nelson', 'Anne Perez'], 'Q4': ['Nancy Jones', 'Ann Coleman', 'Anne Russell', 'Douglas Flores', 'Dorothy Edwards', 'Peter Washington', 'Lois Walker', 'Janet Henderson', 'Joan Stewart', 'Melissa King', 'Debra Wood', 'Mary Wilson', 'Jimmy Howard', 'Rebecca Stewart', 'Judy Hernandez', 'Clarence Ross', 'Cheryl Scott']}

In [12]:
# 3. Verification of results by alternate method

# Let's verify if above results are correct by comparing list of Q1 with
# list obtained by alternate method. 

# For verification, df_employee is filtered on rows with Quarter of Joining
# as Q1 and sliced to keep only First Name and Date of Birth columns. Further
# sliced dataframe is sorted in descending order of Date of Birth. This is
# alternate method which results into same sorted list of employees as above 
# based on Date of Birth and belonging to selected Quarter of Joining. 

verification_df = df_employee[df_employee['Quarter of Joining'] == 'Q1']\
                    [['Full Name', 'Date of Birth']]\
                    .sort_values('Date of Birth', ascending=False)

name_list_for_verification = list(verification_df['Full Name'])

In [13]:
# 4. Check 2 - Let's check if list of Q1 in grouped_sorted_emp_dict is 
# same as name_list_for_verification
if name_list_for_verification == grouped_sorted_emp_dict['Q1']:
    print('\nLists are same. Hence, results are correct and verified.')
else:
    print('\nList are different. Results might be incorrect.')

Lists are same. Hence, results are correct and verified.

In [14]:
# 5. Displaying results
# Displaying dictionary in more readable format

print('\n\nAnswer to Task 3:\n')
for k, v in grouped_sorted_emp_dict.items():
    print(k, ':', v, '\n')

Answer to Task 3:

Q1 : ['Antonio Roberts', 'Ann Cooper', 'Theresa Lee', 'Martha Washington', 'Ernest Martinez', 'Larry Miller', 'Theresa Murphy', 'Diana Peterson', 'Steven Phillips', 'Ernest Washington', 'Cynthia Ramirez', 'Amy Howard', 'Maria Walker', 'Joshua Stewart', 'Aaron Price', 'Roger Roberts', 'Ruby Stewart', 'William Hernandez', 'Jeremy Sanchez', 'Nicole Ward', 'Elizabeth Jackson', 'Joe Robinson', 'Julia Scott', 'Judy Gonzales', 'Carolyn Hayes', 'Carol Murphy']

Q2 : ['Jack Alexander', 'Carol Edwards', 'Melissa Butler', 'Linda Moore', 'Daniel Cooper', 'Andrea Garcia', 'Henry Jenkins', 'Amanda Hughes', 'Lillian Brown', 'Margaret Allen', 'Tammy Young', 'Phillip White', 'Deborah Smith', 'Diane Evans', 'Carolyn Price', 'Kelly Adams', 'Ralph Flores', 'Cynthia White', 'Mary Bryant', 'Joyce Jenkins', 'Nancy Howard', 'Frances Young', 'Paul Watson']

Q3 : ['Wayne Watson', 'Pamela Wright', 'Nancy Baker', 'Jose Hill', 'Matthew Turner', 'Gregory Edwards', 'Richard Mitchell', 'Ryan Alexander', 'Margaret Brooks', 'Paul Cooper', 'Todd Hall', 'Roy Griffin', 'Sharon Lopez', 'Cheryl Miller', 'Jack Campbell', 'Harold Nelson', 'Nancy Davis', 'Donna Brown', 'Patrick Bailey', 'Janice Parker', 'Ruby Rogers', 'Eugene Perez', 'Alan Rivera', 'Benjamin Russell', 'Lillian Mitchell', 'Jason Anderson', 'Carl Collins', 'Brenda Robinson', 'Thomas Lewis', 'Paula Diaz', 'Brenda Butler', 'Frances Watson', 'Christopher Nelson', 'Anne Perez']

Q4 : ['Nancy Jones', 'Ann Coleman', 'Anne Russell', 'Douglas Flores', 'Dorothy Edwards', 'Peter Washington', 'Lois Walker', 'Janet Henderson', 'Joan Stewart', 'Melissa King', 'Debra Wood', 'Mary Wilson', 'Jimmy Howard', 'Rebecca Stewart', 'Judy Hernandez', 'Clarence Ross', 'Cheryl Scott']